#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/wellsiau-org/workspace-manager/runs/run-REYxwpyzECS72Dt9

Waiting for the plan to start...

Terraform v1.13.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tfe_variable.aws_region will be created
  + resource "tfe_variable" "aws_region" {
      + category       = "terraform"
      + hcl            = false
      + id             = (known after apply)
      + key            = "region"
      + readable_value = "us-west-2"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # tfe_variable.aws_role_arn will be created
  + resource "tfe_variable" "aws_role_arn" {
      + category       = "env"
      + hcl            = false
      + id             = (known after apply)
      + key            = "TFC_AWS_RUN_ROLE_ARN"
      + readable_value = "arn:aws:iam::743794601996:role/kunduso-hashiconf-hallaway-track-2025"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # tfe_variable.aws_role_auth will be created
  + resource "tfe_variable" "aws_role_auth" {
      + category       = "env"
      + hcl            = false
      + id             = (known after apply)
      + key            = "TFC_AWS_PROVIDER_AUTH"
      + readable_value = "true"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # tfe_workspace.ephemeral will be created
  + resource "tfe_workspace" "ephemeral" {
      + agent_pool_id                  = (known after apply)
      + allow_destroy_plan             = true
      + auto_apply                     = true
      + auto_apply_run_trigger         = false
      + auto_destroy_activity_duration = "1h"
      + auto_destroy_at                = (known after apply)
      + execution_mode                 = (known after apply)
      + file_triggers_enabled          = true
      + force_delete                   = false
      + global_remote_state            = (known after apply)
      + html_url                       = (known after apply)
      + id                             = (known after apply)
      + name                           = "hallaway-track-hashiconf-2025"
      + operations                     = (known after apply)
      + organization                   = "wellysiau-org"
      + project_id                     = (known after apply)
      + queue_all_runs                 = false
      + remote_state_consumer_ids      = (known after apply)
      + resource_count                 = (known after apply)
      + speculative_enabled            = true
      + structured_run_output_enabled  = true
      + tag_names                      = [
          + "demo",
          + "ephemeral",
          + "hashiconf-2025",
        ]
      + terraform_version              = (known after apply)
      + working_directory              = "02-infrastructure"

      + vcs_repo {
          + branch             = "main"
          + identifier         = "kunduso/terraform-ephemeral-workspace"
          + ingress_submodules = false
          + oauth_token_id     = "ot-ng3aNpPUDciHp8nE"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + workspace_url = "https://app.terraform.io/app/wellysiau-org/workspaces/hallaway-track-hashiconf-2025"

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*